Repository: IamWills/CNothing
Catalog: iOS/cnothing/cnothing/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Account
zh_hans: 账户

source: Accounts
zh_hans: 账号

source: Add Account
zh_hans: 添加账号

source: Add Another Account
zh_hans: 添加其他账号

source: Allowed hosts
zh_hans: 允许访问的主机

source: Approval
zh_hans: 审批

source: Approvals
zh_hans: 授权

source: Approve
zh_hans: 批准

source: Approved. Grant %@… is now active.
zh_hans: 已批准，grant %@… 已生效。

source: Authorization Request
zh_hans: 授权请求

source: Cancel
zh_hans: 取消

source: Cannot reach the server. Tap Refresh to retry.
zh_hans: 无法连接服务器。请点「刷新」重试。

source: CNothing Approvals
zh_hans: CNothing 审批

source: Connection
zh_hans: 连接

source: Denied.
zh_hans: 已拒绝。

source: Deny
zh_hans: 拒绝

source: Device
zh_hans: 设备

source: Device is not paired yet
zh_hans: 设备尚未配对

source: Device signing failed. Re-pair this device to enroll its signing key.
zh_hans: 设备签名失败，请重新配对以注册设备密钥。

source: Done
zh_hans: 完成

source: e.g. K7PQ2MXR
zh_hans: 例如 K7PQ2MXR

source: Each account is a CNothing user paired to this phone. Switch accounts to review and approve that user's agent requests.
zh_hans: 每个账户对应一个已配对到本机的 CNothing 用户。切换账户可查看并批准该用户的 agent 请求。

source: Enabled
zh_hans: 已开启

source: Generate a pairing QR on the CNothing Console Devices page for the account you want to add, then scan it here.
zh_hans: 在 CNothing Console 的 Devices 页为要添加的账户生成配对二维码，然后在此扫描。

source: Invalid request URL.
zh_hans: 无效的请求地址。

source: Loading…
zh_hans: 加载中…

source: Manage Accounts
zh_hans: 管理账号

source: Network error: %@. Tap Refresh to retry.
zh_hans: 网络错误：%@。请点「刷新」重试。

source: No Accounts
zh_hans: 暂无账号

source: No available %@ connection. Connect one first on the CNothing Console Connect page.
zh_hans: 没有可用的 %@ 连接。请先在网页 Console 的 Connect 页完成一次 OAuth 连接。

source: No network connection. Check Wi‑Fi or cellular, then tap Refresh.
zh_hans: 无网络连接。请检查 Wi‑Fi 或蜂窝网络后点「刷新」。

source: No OAuth connections yet. Connect one on the CNothing Console.
zh_hans: 尚未连接 OAuth。请先在 CNothing Console 完成连接。

source: No pending authorization requests for this account. Switch accounts above, or ask the agent to pass your user_id / open approval_url.
zh_hans: 当前账户没有待审批请求。可在上方切换账户，或让 agent 传入你的 user_id / 打开 approval_url。

source: No pending authorization requests. Ask an agent to request access, or open an approval link.
zh_hans: 暂无待审批请求。可让 agent 发起授权，或打开审批链接。

source: No pending authorization requests. When an agent calls request_access with your user_id, requests appear here and are pushed to this phone.
zh_hans: 暂无待审批的授权请求。Agent 调用 request_access 并携带你的 user_id 后，请求会出现在这里并推送到手机。

source: OAuth Connection
zh_hans: 使用的 OAuth 连接

source: OAuth Connections
zh_hans: OAuth 连接

source: Or enter the pairing code manually
zh_hans: 或手动输入配对码

source: Pair
zh_hans: 配对

source: Pair as Approval Device
zh_hans: 绑定为审批设备

source: Pending Requests
zh_hans: 待审批请求

source: Platform
zh_hans: 平台

source: Polling
zh_hans: 使用轮询

source: Provider
zh_hans: 提供商

source: Push
zh_hans: 推送

# PUSH_APPROVAL_BODY
source: %1$@ requests access to %2$@
zh_hans: %1$@ 请求访问 %2$@

# PUSH_APPROVAL_TITLE
source: CNothing Authorization Request
zh_hans: CNothing 授权请求

source: Reason
zh_hans: 理由

source: Refresh
zh_hans: 刷新

source: Remove
zh_hans: 移除

source: Remove Account
zh_hans: 移除账号

source: Remove this account?
zh_hans: 移除此账号？

source: Request timed out. Tap Refresh to retry.
zh_hans: 请求超时。请点「刷新」重试。

source: Requests from every paired account are listed here.
zh_hans: 此处列出全部已绑定账号的请求。

source: Scan Pairing QR Code
zh_hans: 扫描配对二维码

source: Scan QR Code to Pair
zh_hans: 扫描二维码绑定

source: Secure connection failed (TLS). Tap Refresh to retry.
zh_hans: 安全连接失败（TLS）。请点「刷新」重试。

source: Sign in to the CNothing Console on the web, open the Devices page to generate a pairing QR code, then scan it here. You'll receive and approve agent authorization requests on this phone, just like Microsoft Authenticator.
zh_hans: 在 CNothing Console（网页端登录后）打开 Devices 页生成配对二维码，扫码即可绑定。之后就能像 Microsoft Authenticator 一样在手机上接收并批准 agent 的授权请求。

source: Status
zh_hans: 状态

source: Stop approving requests for %@ on this phone.
zh_hans: 停止在本机审批 %@ 的请求。

source: Tap + to pair a CNothing account from the Console Devices page.
zh_hans: 点右上角 +，用 Console Devices 页的配对码绑定 CNothing 账号。

source: Tap an account to manage it. Approvals for every account appear in the Approvals tab.
zh_hans: 点某个账号可进入管理页。所有账号的审批请求都在「授权」页。

source: This device cannot scan QR codes. Enter the pairing code manually.
zh_hans: 此设备不支持相机扫码，请手动输入配对码。

source: Unbind Account
zh_hans: 解绑账号

source: Unbind this account?
zh_hans: 解绑此账号？

source: Unbinding stops this phone from approving requests for this account. Other paired accounts are unaffected.
zh_hans: 解绑后，本机将不再审批该账号的请求；不影响其他已绑定账号。

source: Unpair
zh_hans: 解除配对

source: Unpair this device?
zh_hans: 解除此设备的配对？

source: Unrecognized QR code. Scan the pairing QR generated on the CNothing Console Devices page.
zh_hans: 无法识别的二维码，请扫描 CNothing Console Devices 页生成的配对二维码。

source: You will stop receiving approval requests for %@ on this phone.
zh_hans: 你将不再在此手机上收到 %@ 的审批请求。

source: You will stop receiving approval requests on this phone until you pair again.
zh_hans: 解除后，在重新配对之前，此手机将不再收到审批请求。
